Vapi27/gottfa-esp32/src/arena_net.cpp
// Balayage WiFi. Lance depuis la boucle principale, jamais depuis un handler :
// WiFi.scanNetworks() bloque 2 a 5 s, et bloquer la tache AsyncTCP est
// exactement ce qui tuait la carte pendant les mises a jour.
// Pourquoi la derniere tentative d'association a echoue. Sans ca, un mot de
// passe faux, un reseau absent et un reseau en 5 GHz donnent tous le meme
// resultat visible : la carte repart en point d'acces, sans un mot.
static String        s_staReason  = "";

static volatile bool s_scanWanted = false;
static String        s_scanJson   = "[]";
// Pourquoi un balayage n'a rien rendu. Une liste vide est ambigue - refus du
// pilote, ou vraiment aucun reseau - et les deux se soignent differemment.
static String        s_scanErr    = "";

// Un ecran noir et une carte qui redemarre se ressemblent de l'exterieur. La
// difference se lit ici : le compteur monte a chaque demarrage, et la cause du
// dernier reset dit si c'etait une coupure, un plantage ou un chien de garde.
static uint8_t       s_statPin    = ARENA_STATUS_PIN;
static String        s_reset      = "?";
static uint32_t      s_boots      = 0;

// Un brownout ne laisse aucune trace apres le redemarrage suivant : la cause du
// reset ne parle que du DERNIER. Ce compteur-la, lui, tient le total, et c est
// lui qui distingue "une fois, en debranchant" de "a chaque rafale WiFi".
static uint32_t      s_brownouts  = 0;
static uint8_t       s_txq        = ARENA_WIFI_TXPWR_QDBM;   // quarts de dBm
static bool          s_txDerated  = false;   // baissee d office apres un brownout

// A appeler seulement quand la radio tourne (esp_wifi_start est passe) : sinon
// l IDF repond ESP_ERR_WIFI_NOT_STARTED et la valeur est perdue en silence.
static void applyTxPower() {
  const esp_err_t e = esp_wifi_set_max_tx_power((int8_t)s_txq);
  if (e != ESP_OK) {
    Serial.printf("[net] puissance TX refusee (%d)\n", (int)e);
    return;
  }
  Serial.printf("[net] puissance TX = %.2f dBm%s\n", s_txq / 4.0f,
                s_txDerated ? "  (baissee apres un brownout)" : "");
}

static const char* resetReasonName(esp_reset_reason_t r) {
  switch (r) {
    case ESP_RST_POWERON:   return "mise sous tension";
    case ESP_RST_EXT:       return "reset externe (bouton)";
    case ESP_RST_SW:        return "redemarrage logiciel";
    case ESP_RST_PANIC:     return "PLANTAGE (panic)";
    case ESP_RST_INT_WDT:   return "chien de garde d interruption";
    case ESP_RST_TASK_WDT:  return "chien de garde de tache";
    case ESP_RST_WDT:       return "chien de garde";
    case ESP_RST_BROWNOUT:  return "BROWNOUT (alimentation)";
    case ESP_RST_DEEPSLEEP: return "reveil de sommeil profond";
    default:                return "inconnue";
  }
}
static uint32_t      s_scanAt     = 0;

// Envoi par morceaux depuis le navigateur (/api/fw).
static esp_ota_handle_t     s_fwHandle = 0;
static const esp_partition_t* s_fwPart = nullptr;
static size_t               s_fwTotal = 0, s_fwGot = 0;
static uint32_t             s_fwReboot = 0;   // 0 = pas de redemarrage arme

static bool pullOta(const String& url, bool fs, String& err) {
  if (!url.startsWith("http://")) { err = "seul http:// est supporte"; return false; }
  const int slash     = url.indexOf('/', 7);
  const String hostp  = (slash < 0) ? url.substring(7) : url.substring(7, slash);
  const String path   = (slash < 0) ? "/" : url.substring(slash);
  const int colon     = hostp.indexOf(':');
  const String host   = (colon < 0) ? hostp : hostp.substring(0, colon);
  const uint16_t port = (colon < 0) ? 80 : (uint16_t)hostp.substring(colon + 1).toInt();

  WiFiClient c;
  if (!c.connect(host.c_str(), port)) { err = "connexion refusee " + hostp; return false; }
  c.print(String("GET ") + path + " HTTP/1.1\r\nHost: " + hostp +
          "\r\nConnection: close\r\nAccept-Encoding: identity\r\n\r\n");

  int status = 0; long len = -1;
  const uint32_t tHdr = millis();
  while (true) {
    if (millis() - tHdr > 15000) { err = "timeout en-tetes"; return false; }
    if (!c.available()) {
      if (!c.connected()) { err = "coupe pendant les en-tetes"; return false; }
      delay(5); continue;
    }
    String line = c.readStringUntil('\n'); line.trim();
    if (line.length() == 0) break;                       // fin des en-tetes
    if (!status && line.startsWith("HTTP/")) status = line.substring(9, 12).toInt();
    String low = line; low.toLowerCase();
    if (low.startsWith("content-length:")) len = line.substring(15).toInt();
  }
  if (status != 200) { err = "HTTP " + String(status); return false; }
  if (len <= 0) { err = "Content-Length absent (chunked non gere)"; return false; }

  // Deux destinations : l'application (via esp_ota_*) ou la partition du
  // systeme de fichiers, qui porte l'interface web. La seconde s'ecrit a la
  // main - il n'y a pas d'API "ota" pour elle - et LittleFS doit etre demonte
  // avant, sinon on reecrit sous les pieds du serveur qui vient de servir la page.
  const esp_partition_t* part = fs
      ? esp_partition_find_first(ESP_PARTITION_TYPE_DATA,
                                 ESP_PARTITION_SUBTYPE_DATA_SPIFFS, NULL)
      : esp_ota_get_next_update_partition(NULL);
  if (!part) { err = fs ? "partition fichiers introuvable" : "aucune partition OTA libre"; return false; }
  if ((size_t)len > part->size) {
    err = "image trop grande (" + String((uint32_t)len) + " > " + String(part->size) + ")";
    return false;
  }

  esp_ota_handle_t h = 0;
  esp_err_t e = ESP_OK;
  if (fs) {
    LittleFS.end();
    e = esp_partition_erase_range(part, 0, (((size_t)len) + 4095) & ~((size_t)4095));
    if (e != ESP_OK) { err = String("erase: ") + esp_err_to_name(e); return false; }
  } else {
    e = esp_ota_begin(part, (size_t)len, &h);
    if (e != ESP_OK) { err = String("esp_ota_begin: ") + esp_err_to_name(e); return false; }
  }

  s_pullTotal = (uint32_t)len;
  s_pullDone  = 0;
  static uint8_t buf[1460];                              // statique : pas sur la pile
  uint32_t tLast = millis();
  while (s_pullDone < (uint32_t)len) {
    const int n = c.read(buf, sizeof(buf));
    if (n > 0) {
      e = fs ? esp_partition_write(part, s_pullDone, buf, (size_t)n)
             : esp_ota_write(h, buf, (size_t)n);
      if (e != ESP_OK) {
        if (!fs) esp_ota_abort(h);
        err = String(fs ? "partition_write: " : "esp_ota_write: ") + esp_err_to_name(e);
        return false;
      }
      s_pullDone += (uint32_t)n;
      tLast = millis();
      // Respiration obligatoire : sans elle cette boucle monopolise le coeur et
      // le task watchdog tue la tache IDLE. 1 ms par paquet de 1460 octets
      // plafonne a ~1,4 Mo/s, tres au-dessus du debit reseau reel.
      delay(1);
    } else {
      if (!c.connected() && !c.available()) break;
      if (millis() - tLast > 20000) { esp_ota_abort(h); err = "timeout reception"; return false; }
      delay(2);
    }
  }
  if (s_pullDone != (uint32_t)len) {
    if (!fs) esp_ota_abort(h);
    err = "tronque " + String(s_pullDone) + "/" + String((uint32_t)len);
    return false;
  }
  if (fs) return true;                       // rien a valider : le redemarrage remonte LittleFS
  e = esp_ota_end(h);
  if (e != ESP_OK) { err = String("esp_ota_end: ") + esp_err_to_name(e); return false; }
  e = esp_ota_set_boot_partition(part);
  if (e != ESP_OK) { err = String("set_boot: ") + esp_err_to_name(e); return false; }
  return true;
}

