Vapi27/gottfa-esp32/src/arena_net.cpp
void resetNetwork() {
  s_prefs.clear();
  Serial.println("[net] nom et identifiants WiFi effaces");
}

void forgetHomes() {
#ifdef ARENA_MATTER
  arena_matter_forget();
#else
  Serial.println("[net] pas de Matter dans cette image - rien a oublier");
#endif
}

static String stateJson() {
  arenaled::Rgbw c = arenaled::color();
  String j = "{";
  j += "\"fw\":\"" ARENA_FW_VERSION "\"";
  j += ",\"mode\":\"" + String(arenaled::modeName(arenaled::mode())) + "\"";
  j += ",\"bright\":" + String(arenaled::brightness());
  j += ",\"speed\":"  + String(arenaled::speed());
  j += ",\"gi\":"     + String(arenaled::gi());
  j += ",\"density\":" + String(arenaled::density());
  j += ",\"warm\":"   + String(arenaled::warm());
  j += ",\"inc\":"    + String(arenaled::incandescent() ? 1 : 0);
  j += ",\"boot\":"   + String(arenaled::bootOn() ? 1 : 0);
  // What the wall is running: seconds of ROM attract (0 = generic fallback)
  // and how many inserts the plan carries. The Game panel reads these.
  j += ",\"atr\":"    + String(arenaattract::available()
                              ? arenaattract::frames() * arenaattract::stepMs() / 1000 : 0);
  j += ",\"ins\":"    + String(arenapf::insertCount());
  j += ",\"fsu\":"    + String(LittleFS.usedBytes());
  j += ",\"fst\":"    + String(LittleFS.totalBytes());
  j += ",\"count\":"  + String(arenaled::count());
  j += ",\"max\":"    + String(LED_MAX);
  j += ",\"r\":" + String(c.r) + ",\"g\":" + String(c.g) +
       ",\"b\":" + String(c.b) + ",\"w\":" + String(c.w);
  j += ",\"amps\":"   + String(arenaled::lastAmps(), 2);
  // Also in mA: two decimals of an amp cannot show a bench of one or three LEDs
  // (a single pixel in TEST mode is ~4 mA, which prints as "0.00" and reads like
  // a broken meter). mA is what the multimeter in the +5 V wire shows anyway.
  j += ",\"ma\":"     + String(arenaled::lastAmps() * 1000.0f, 1);
  j += ",\"budget\":" + String(arenaled::budgetMa());
  j += ",\"order\":\""  + String(arenaled::order()) + "\"";
  j += ",\"limited\":" + String(arenaled::limited() ? "true" : "false");
  j += ",\"fps\":"    + String(arenaled::fps());
  // Diagnostic sortie LED : pin reellement compilee, trames emises, echecs.
  j += ",\"pin\":"      + String(PIN_LED_DATA);
  j += ",\"rmtframes\":" + String((uint32_t)espShowFrames);
  j += ",\"rmtfail\":"  + String((uint32_t)espShowRmtFail);
  j += ",\"lockmiss\":" + String((uint32_t)espShowLockMiss);
  // Rendu gele pendant un appairage BLE. Sans ce champ, fps/ma/rmtframes figes
  // ressemblent a s'y meprendre a un rendu normal.
  j += ",\"paused\":" + String(arenaled::paused() ? "true" : "false");
  // L'ecran a-t-il repondu sur l'I2C au demarrage ? Sans ce temoin, un panneau
  // muet est indiscernable d'un panneau absent, d'une mauvaise adresse ou d'un
  // fil inverse - et il n'y a pas de port serie sur un mur accroche.
  j += ",\"oled\":" + String(arenaoled::found() ? "true" : "false");
  j += ",\"bustype\":"  + String((int32_t)espShowBusType);
  // Memoire. C'est ce qui decide si la PSRAM est necessaire : ce qui compte
  // n'est pas le total mais le plus BAS jamais atteint, car le manque de tas ne
  // se manifeste qu'a la pointe - typiquement la poignee de main d'appairage.
  j += ",\"heap\":"    + String((uint32_t)ESP.getFreeHeap());
  j += ",\"heapmin\":" + String((uint32_t)ESP.getMinFreeHeap());
  j += ",\"heapblk\":" + String((uint32_t)ESP.getMaxAllocHeap());
  j += ",\"psram\":"   + String((uint32_t)ESP.getFreePsram());

  // Retour arriere OTA : l'etat de l'image qui tourne. C'est ce qui dit si le
  // filet est reellement arme, et un cable serie n'est pas une facon durable de
  // le verifier - une OTA reenumere l'USB natif et le port disparait.
  //   "trial"   installee, pas encore declaree saine : un redemarrage revient
  //             a l'ancienne image
  //   "valid"   declaree saine, plus de retour en arriere
  //   "nofw"    le bootloader n'a pas le retour arriere (option absente)
  {
    esp_ota_img_states_t ost;
    const esp_partition_t* rp = esp_ota_get_running_partition();
    const char* v = "nofw";
    if (rp && esp_ota_get_state_partition(rp, &ost) == ESP_OK) {
      if      (ost == ESP_OTA_IMG_PENDING_VERIFY) v = "trial";
      else if (ost == ESP_OTA_IMG_VALID)          v = "valid";
      else if (ost == ESP_OTA_IMG_UNDEFINED)      v = "nofw";
      else                                        v = "other";
    }
    j += ",\"otavalid\":\"" + String(v) + "\"";
    j += ",\"slot\":\"" + String(rp ? rp->label : "?") + "\"";
  }

  // Les autres murs vus sur le reseau, et le comportement choisi face a eux.
  j += ",\"link\":\"" + String(arenapeers::linkName(arenapeers::link())) + "\"";
  j += ",\"rank\":"  + String((int)arenapeers::rank());
  j += ",\"shared\":" + String(arenapeers::sharedPower() ? 1 : 0);
  j += ",\"share\":"  + String((int)arenaled::budgetShare());
  j += ",\"peers\":" + arenapeers::json();

  // Defaut du limiteur de sortie : le seul signal materiel qui dit qu'il se
  // passe quelque chose AU BOUT du cable, la ou personne ne regarde.
  j += ",\"ledfault\":"  + String(arenaled::ledFault() ? 1 : 0);
  j += ",\"ledfaultn\":" + String((int)arenaled::ledFaultCount());

  // Qui est ce mur. Indispensable des qu'il y en a plusieurs : c'est ce qui
  // permet de balayer le reseau et de dire lequel est lequel.
  j += ",\"name\":\"" + s_name + "\"";
  j += ",\"mac\":\""  + s_mac  + "\"";

  // OTA en mode pull : ou en est le telechargement declenche par /api/otapull.
  j += ",\"otast\":\""  + s_pullStatus + "\"";
  j += ",\"otadone\":"  + String(s_pullDone);
  j += ",\"otatot\":"   + String(s_pullTotal);
  j += ",\"fwgot\":"   + String((uint32_t)s_fwGot);
  j += ",\"fwtot\":"   + String((uint32_t)s_fwTotal);
#ifdef ARENA_MATTER
  // A combien de maisons la carte appartient. Si Maison dit "deja dans une autre
  // maison", c'est ce nombre qu'il faut regarder avant de conclure quoi que ce soit.
  j += ",\"fabrics\":" + String((int)arena_matter_fabrics());
  j += ",\"mev\":\"" + String(arena_matter_last_event()) + "\"";
  { char ev[560]; arena_matter_event_log(ev, sizeof(ev));
    j += ",\"mevlog\":\"" + String(ev) + "\""; }
#endif
  // Empreinte de build : les 8 premiers octets du SHA256 de l'ELF. C'est le SEUL
  // champ qui prouve qu'une OTA a bien remplace l'image - l'uptime ne prouve
  // rien (un envoi qui plante redemarre la carte exactement pareil), et un
  // compteur remis a zero au boot non plus.
  {
    const esp_app_desc_t* d = ARENA_APP_DESC();
    char sha[17];
    for (int i = 0; i < 8; i++) sprintf(sha + i * 2, "%02x", d->app_elf_sha256[i]);
    sha[16] = 0;
    j += ",\"build\":\"" + String(sha) + "\"";
  }
  j += ",\"ip\":\""   + s_ip + "\",\"net\":\"" + s_mode + "\"";
  j += ",\"staFail\":\"" + s_staReason + "\"";
  j += ",\"reset\":\"" + s_reset + "\",\"boots\":" + String(s_boots);
  j += ",\"brownouts\":" + String(s_brownouts);
  j += ",\"txpwr\":" + String(s_txq / 4.0f, 2);
  j += ",\"txDerated\":" + String(s_txDerated ? 1 : 0);
  j += ",\"up\":"     + String(millis() / 1000);
  j += ",\"heap\":"   + String(ESP.getFreeHeap());
  j += "}";
  return j;
}

static uint8_t param8(AsyncWebServerRequest* r, const char* k, uint8_t cur) {
  if (!r->hasParam(k)) return cur;
  long v = r->getParam(k)->value().toInt();
  if (v < 0) v = 0;
  if (v > 255) v = 255;
  return (uint8_t)v;
}

