Vapi27/gottfa-esp32/src/arena_net.cpp
static void startServer() {
  // --- UI ---------------------------------------------------------------
  s_server.on("/", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (LittleFS.exists("/arena.html")) r->send(LittleFS, "/arena.html", "text/html");
    else                                r->send_P(200, "text/html", FALLBACK);
  });

  // --- State / control ----------------------------------------------------
  s_server.on("/api/state", HTTP_GET, [](AsyncWebServerRequest* r) {
    r->send(200, "application/json", stateJson());
  });

  //  /api/set?mode=arena&bright=180&speed=128&r=255&g=100&b=0&w=0&count=100&budget=9000&order=grbw
  s_server.on("/api/set", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (r->hasParam("mode")) {
      arenaled::Mode m = arenaled::modeFromName(r->getParam("mode")->value().c_str());
      if (m == arenaled::MODE_COUNT) { r->send(400, "text/plain", "bad mode"); return; }
      arenaled::setMode(m);
    }
    if (r->hasParam("bright")) arenaled::setBrightness(param8(r, "bright", arenaled::brightness()));
    if (r->hasParam("speed"))  arenaled::setSpeed(param8(r, "speed", arenaled::speed()));
    if (r->hasParam("gi"))     arenaled::setGi(param8(r, "gi", arenaled::gi()));
    if (r->hasParam("density")) arenaled::setDensity(param8(r, "density", arenaled::density()));
    if (r->hasParam("warm"))   arenaled::setWarm(param8(r, "warm", arenaled::warm()));
    if (r->hasParam("inc"))    arenaled::setIncandescent(r->getParam("inc")->value().toInt() != 0);
    if (r->hasParam("boot"))   arenaled::setBootOn(r->getParam("boot")->value().toInt() != 0);
    if (r->hasParam("r") || r->hasParam("g") || r->hasParam("b") || r->hasParam("w")) {
      arenaled::Rgbw c = arenaled::color();
      c.r = param8(r, "r", c.r);
      c.g = param8(r, "g", c.g);
      c.b = param8(r, "b", c.b);
      c.w = param8(r, "w", c.w);
      arenaled::setColor(c);
    }
    if (r->hasParam("order")) {
      if (!arenaled::setOrder(r->getParam("order")->value().c_str())) {
        r->send(400, "text/plain", "bad order (grbw|rgbw|gbrw|brgw|rbgw|bgrw)");
        return;
      }
    }
    if (r->hasParam("count"))  arenaled::setCount((uint16_t)r->getParam("count")->value().toInt());
    if (r->hasParam("budget")) arenaled::setBudgetMa((uint16_t)r->getParam("budget")->value().toInt());
    if (r->hasParam("repeater")) arenaled::setRepeater(r->getParam("repeater")->value().toInt() != 0);
    if (r->hasParam("pin"))      arenaled::setPin((uint8_t)r->getParam("pin")->value().toInt());
    if (r->hasParam("statuspin")) {
      const uint8_t p = (uint8_t)r->getParam("statuspin")->value().toInt();
      if (p <= 48) { s_statPin = p; s_prefs.putUChar("statpin", p); }
    }
    // /api/set?txpwr=13   puissance d emission en dBm (2..20). Baisser echange
    // de la portee contre des rafales de courant plus petites : c est le seul
    // levier logiciel sur un brownout, et il ne repare pas une alimentation.
    if (r->hasParam("txpwr")) {
      float d = r->getParam("txpwr")->value().toFloat();
      if (d < 2)  d = 2;
      if (d > 20) d = 20;
      s_txq = (uint8_t)lroundf(d * 4.0f);
      s_txDerated = false;              // choix explicite du proprietaire
      s_prefs.putUChar("txq", s_txq);
      applyTxPower();
    }
    r->send(200, "application/json", stateJson());
  });

  // /api/latch?n=L9,L48   lamps held lit through attract, by the MACHINE's name
  // /api/latch?clear=1    release them all
  // Named, not numbered: the owner reads L9 off the playfield, and the mask
  // underneath is in PinMAME's numbering, which nobody should have to know.
  s_server.on("/api/latch", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (r->hasParam("clear")) { arenaled::setLatched(0); arenaled::save(); }
    else if (r->hasParam("n")) {
      uint64_t m = 0;
      String list = r->getParam("n")->value();
      list.trim();
      int start = 0;
      while (start < (int)list.length()) {
        int comma = list.indexOf(',', start);
        if (comma < 0) comma = list.length();
        String one = list.substring(start, comma);
        one.trim();
        start = comma + 1;
        if (!one.length()) continue;
        const int idx = arenapf::indexOf(one.c_str());
        const arenapf::Insert* ins = (idx >= 0) ? arenapf::insert((uint8_t)idx) : nullptr;
        if (!ins || ins->lamp < 0) {
          r->send(400, "text/plain", "unknown insert: " + one);
          return;
        }
        m |= (1ULL << ins->lamp);
      }
      arenaled::setLatched(m);
      arenaled::save();
    }
    // Answer in the owner's names, not in the internal mask.
    String out = "{\"latched\":[";
    bool first = true;
    const uint64_t m = arenaled::latched();
    for (uint8_t i = 0; i < arenapf::insertCount(); i++) {
      const arenapf::Insert* ins = arenapf::insert(i);
      if (!ins || ins->lamp < 0 || !((m >> ins->lamp) & 1ULL)) continue;
      if (!first) out += ',';
      first = false;
      out += "\"" + String(ins->name) + "\"";
    }
    out += "]}";
    r->send(200, "application/json", out);
  });

  //  /api/music?e=..&b=..&t=..   0..255 — drive the music mode from anything
  //  that can hit REST at ~20 Hz. Overrides the on-board mic for 2 s per push.
  s_server.on("/api/music", HTTP_GET, [](AsyncWebServerRequest* r) {
    arenaled::musicPush(param8(r, "e", 0), param8(r, "b", 0), param8(r, "t", 0));
    r->send(200, "text/plain", "ok");
  });

  s_server.on("/api/save", HTTP_GET, [](AsyncWebServerRequest* r) {
    arenaled::save();
    r->send(200, "text/plain", "saved");
  });

  // --- Mapping wizard -----------------------------------------------------
  //  /api/identify?led=42 | ?zone=3 | ?clear=1   (ms= optional, default 10 s)
  s_server.on("/api/identify", HTTP_GET, [](AsyncWebServerRequest* r) {
    uint32_t ms = r->hasParam("ms") ? (uint32_t)r->getParam("ms")->value().toInt() : 10000;
    if (r->hasParam("clear"))     arenaled::clearIdentify();
    else if (r->hasParam("led"))  arenaled::identifyLed(r->getParam("led")->value().toInt(), ms);
    else if (r->hasParam("zone")) arenaled::identifyZone(r->getParam("zone")->value().toInt(), ms);
    else { r->send(400, "text/plain", "led= | zone= | clear=1"); return; }
    r->send(200, "text/plain", "ok");
  });

  // ---- Sub-paths must be registered BEFORE their parent --------------------
  // This server matches a handler when the request URL equals its URI *or*
  // starts with it followed by '/'. So "/api/zones" also answers
  // "/api/zones/reset", and whichever was registered first wins. Registered the
  // other way round, /api/zones/reset silently returned the zone list and the
  // UI's "Reset to template" button did nothing at all - which is exactly what
  // it had been doing, unnoticed, since there was no hardware to try it on.
  s_server.on("/api/zones/reset", HTTP_GET, [](AsyncWebServerRequest* r) {
    arenamap::reset();
    arenamap::save();
    r->send(200, "application/json", arenamap::toJson());
  });

  s_server.on("/api/ledmap/reset", HTTP_GET, [](AsyncWebServerRequest* r) {
    arenapf::clearAssignment();
    arenapf::save();
    r->send(200, "text/plain", "cleared");
  });

  s_server.on("/api/zones", HTTP_GET, [](AsyncWebServerRequest* r) {
    r->send(200, "application/json", arenamap::toJson());
  });

