Vapi27/gottfa-esp32/src/arena_net.cpp
  s_server.on("/api/wifiscan", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (r->hasParam("results")) {
      wifi_ap_record_t apInfo = {};
      const bool apInfoOk = (esp_wifi_sta_get_ap_info(&apInfo) == ESP_OK);
      String j = "{\"fail\":\"" + s_staReason + "\"" +
                 ",\"scanErr\":\"" + s_scanErr + "\"" +
                 ",\"age\":" + String(s_scanAt ? (millis() - s_scanAt) / 1000 : 9999) +
                 ",\"busy\":" + String(s_scanWanted ? "true" : "false") +
                 ",\"rssi\":" + String(apInfoOk ? (int)apInfo.rssi : 0) +
                 ",\"ssid\":\"" + String(apInfoOk ? (const char*)apInfo.ssid : "") + "\"" +
                 ",\"nets\":" + s_scanJson + "}";
      r->send(200, "application/json", j);
      return;
    }
    s_scanWanted = true;
    r->send(200, "text/plain", "scan lance");
  });

  s_server.on("/api/fw", HTTP_POST,
    [](AsyncWebServerRequest* r) {
      // --- begin : reserve et efface, une bonne fois ---
      if (r->hasParam("begin")) {
        const size_t sz = (size_t)r->getParam("begin")->value().toInt();
        if (sz < 65536) { r->send(400, "text/plain", "taille invalide"); return; }
        if (s_fwHandle) { esp_ota_abort(s_fwHandle); s_fwHandle = 0; }
        s_fwPart = esp_ota_get_next_update_partition(NULL);
        if (!s_fwPart) { r->send(500, "text/plain", "aucune partition OTA"); return; }
        if (sz > s_fwPart->size) { r->send(400, "text/plain", "image trop grande"); return; }
        // Taille reelle, pas OTA_SIZE_UNKNOWN : on efface ce qu'on ecrit, pas
        // les 3 Mo de la partition.
        const esp_err_t e = esp_ota_begin(s_fwPart, sz, &s_fwHandle);
        if (e != ESP_OK) {
          s_fwHandle = 0;
          r->send(500, "text/plain", String("esp_ota_begin: ") + esp_err_to_name(e));
          return;
        }
        s_fwTotal = sz; s_fwGot = 0;
        r->send(200, "text/plain", "pret");
        return;
      }
      // --- end : valide et redemarre ---
      if (r->hasParam("end")) {
        if (!s_fwHandle) { r->send(409, "text/plain", "aucun envoi en cours"); return; }
        if (s_fwGot != s_fwTotal) {
          esp_ota_abort(s_fwHandle); s_fwHandle = 0;
          r->send(400, "text/plain", "tronque " + String(s_fwGot) + "/" + String(s_fwTotal));
          return;
        }
        esp_err_t e = esp_ota_end(s_fwHandle);
        s_fwHandle = 0;
        if (e != ESP_OK) { r->send(400, "text/plain", String("image refusee: ") + esp_err_to_name(e)); return; }
        e = esp_ota_set_boot_partition(s_fwPart);
        if (e != ESP_OK) { r->send(500, "text/plain", String("set_boot: ") + esp_err_to_name(e)); return; }
        r->send(200, "text/plain", "ok, redemarrage");
        s_fwReboot = millis();          // laisse la reponse partir avant de couper
        return;
      }
      // --- abandon explicite ---
      if (r->hasParam("abort")) {
        if (s_fwHandle) { esp_ota_abort(s_fwHandle); s_fwHandle = 0; }
        s_fwGot = s_fwTotal = 0;
        r->send(200, "text/plain", "abandonne");
        return;
      }
      // --- un morceau : la reponse part ICI, apres l'ecriture ---
      if (!s_fwHandle) { r->send(409, "text/plain", "appelle ?begin= d'abord"); return; }
      r->send(200, "text/plain", String(s_fwGot));
    },
    NULL,
    // Corps brut du morceau. Ecrit au fil de l'eau : un morceau de 32 ko tient
    // dans les tampons, et l'acquittement ci-dessus ne part qu'une fois ecrit.
    [](AsyncWebServerRequest* r, uint8_t* data, size_t len, size_t index, size_t total) {
      if (!s_fwHandle || !len) return;
      if (esp_ota_write(s_fwHandle, data, len) != ESP_OK) {
        esp_ota_abort(s_fwHandle); s_fwHandle = 0;
        return;
      }
      s_fwGot += len;
    });

  s_server.on("/api/otapull", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!r->hasParam("url")) { r->send(400, "text/plain", "url= manquant"); return; }
    if (s_pullPending) { r->send(409, "text/plain", "un telechargement est deja en cours"); return; }
    s_pullUrl     = r->getParam("url")->value();
    s_pullDone    = 0;
    s_pullTotal   = 0;
    s_pullFs      = r->hasParam("target") && r->getParam("target")->value() == "fs";
    s_pullStatus  = "demarre";
    s_pullPending = true;   // la boucle principale prend le relais
    r->send(200, "text/plain", "telechargement lance depuis " + s_pullUrl +
                               "\nsuivre otast / otadone / otatot dans /api/state");
  });

  s_server.on("/update", HTTP_POST,
    [](AsyncWebServerRequest* r) {
      bool ok = !Update.hasError();
      r->send(ok ? 200 : 500, "text/plain", ok ? "OK, rebooting" : "FAIL");
      if (ok) { delay(200); ESP.restart(); }
    },
    [](AsyncWebServerRequest* r, String fn, size_t idx, uint8_t* data, size_t len, bool done) {
      if (!idx) {
        const bool fs = r->hasParam("target") && r->getParam("target")->value() == "fs";
        Serial.printf("[ota] start %s -> %s\n", fn.c_str(), fs ? "filesystem" : "app");
        if (fs) LittleFS.end();                      // cannot be mounted while it is rewritten
        // Taille reelle plutot que UPDATE_SIZE_UNKNOWN : ce dernier efface la
        // partition entiere (3 Mo) d'un bloc et gele AsyncTCP le temps que ca
        // dure, ce qui est la cause du plantage decrit devant pullOta().
        const size_t sz = r->contentLength() ? r->contentLength() : UPDATE_SIZE_UNKNOWN;
        if (!Update.begin(sz, fs ? U_SPIFFS : U_FLASH)) Update.printError(Serial);
      }
      if (Update.write(data, len) != len) Update.printError(Serial);
      if (done) {
        if (Update.end(true)) Serial.printf("[ota] ok %u bytes\n", (unsigned)(idx + len));
        else Update.printError(Serial);
      }
    });

  s_server.serveStatic("/", LittleFS, "/");
  s_server.onNotFound([](AsyncWebServerRequest* r) { r->send(404, "text/plain", "404"); });
  s_server.begin();
}

// Codes de deconnexion de l'IDF, traduits. Les trois premiers couvrent
// l'immense majorite des cas sur une installation domestique.
static const char* staReasonName(uint8_t r) {
  switch (r) {
    case WIFI_REASON_NO_AP_FOUND:        return "reseau introuvable (SSID exact ? 2,4 GHz ?)";
    case WIFI_REASON_AUTH_FAIL:          return "authentification refusee (mot de passe)";
    case WIFI_REASON_HANDSHAKE_TIMEOUT:  return "handshake expire (mot de passe, ou signal trop faible)";
    case WIFI_REASON_ASSOC_FAIL:         return "association refusee par le routeur";
    case WIFI_REASON_AUTH_EXPIRE:        return "authentification expiree";
    case WIFI_REASON_BEACON_TIMEOUT:     return "balise perdue (hors de portee)";
    case WIFI_REASON_CONNECTION_FAIL:    return "connexion refusee";
    default:                             return "echec";
  }
}

