Vapi27/gottfa-esp32/src/arena_net.cpp
void begin() {
  // --- WiFi: NVS credentials (set from the UI) override the compile-time ones ---
  s_prefs.begin("arenanet", false);
  s_statPin = s_prefs.getUChar("statpin", ARENA_STATUS_PIN);
  s_reset = resetReasonName(esp_reset_reason());
  s_boots = s_prefs.getUInt("boots", 0) + 1;
  s_prefs.putUInt("boots", s_boots);
  s_brownouts = s_prefs.getUInt("brown", 0);
  s_txq = s_prefs.getUChar("txq", ARENA_WIFI_TXPWR_QDBM);
  if (esp_reset_reason() == ESP_RST_BROWNOUT) {
    s_brownouts++;
    s_prefs.putUInt("brown", s_brownouts);
    // Revenir a pleine puissance dans une alimentation qui vient de ceder, c est
    // rejouer la meme scene. On baisse pour CETTE session seulement : un blip
    // isole ne doit pas amputer la portee du mur pour toujours, et un reflash
    // ou une coupure propre rend la valeur enregistree.
    if (s_txq > ARENA_WIFI_TXPWR_SAFE_QDBM) {
      s_txq = ARENA_WIFI_TXPWR_SAFE_QDBM;
      s_txDerated = true;
    }
  }
  Serial.printf("[dev] demarrage #%lu - cause du dernier reset : %s\n",
                (unsigned long)s_boots, s_reset.c_str());
  if (s_brownouts) {
    Serial.printf("[dev] %lu brownout(s) au total : le 3,3 V s effondre. Ce n est\n"
                  "      PAS un bug logiciel - cable USB, port ou regulateur.\n",
                  (unsigned long)s_brownouts);
  }
  {
    uint8_t m[6] = {0};
    esp_read_mac(m, ESP_MAC_WIFI_STA);
    char sfx[16]; snprintf(sfx, sizeof(sfx), "%02X%02X", m[4], m[5]);
    char mac[20]; snprintf(mac, sizeof(mac), "%02X:%02X:%02X:%02X:%02X:%02X",
                           m[0], m[1], m[2], m[3], m[4], m[5]);
    s_mac  = mac;
    s_name = s_prefs.getString("name", "");
    if (!s_name.length()) s_name = String("Playfield-") + sfx;
    Serial.printf("[net] mur '%s' (%s)\n", s_name.c_str(), s_mac.c_str());
  }
  String ssid = s_prefs.getString("ssid", ARENA_STA_SSID);
  String pass = s_prefs.getString("pass", ARENA_STA_PASS);

#ifdef ARENA_MATTER
  // Matter owns WiFi: commissioning stores the credentials and CHIP drives
  // esp_wifi. We only wait for an address. No SoftAP (an AP interface fights
  // the CHIP station state machine) and no ESPmDNS (CHIP minimal mDNS holds
  // port 5353) - reach the board by IP; proper mdns unification is P3 work.
  // No blocking wait and NO web server yet: the PASE handshake at pairing
  // time needs every byte of heap this chip has (measured: abort() on the BLE
  // connect with the server up), and a web server without an address serves
  // nobody. matterTick() below brings it up the moment WiFi is provisioned.
  Serial.println("[net] Matter owns WiFi - server deferred until an address");
  s_mode = "Matter";
  s_ip = "0.0.0.0";
  return;
#else
  WiFi.persistent(false);
  WiFi.onEvent([](arduino_event_id_t, arduino_event_info_t info) {
    const uint8_t r = info.wifi_sta_disconnected.reason;
    s_staReason = String(staReasonName(r)) + " [" + String((int)r) + "]";
    Serial.printf("[net] STA echec : %s\n", s_staReason.c_str());
  }, ARDUINO_EVENT_WIFI_STA_DISCONNECTED);

  bool connected = false;
  if (ssid.length()) {
    WiFi.mode(WIFI_STA);
    WiFi.setHostname(hostify(s_name).c_str());
    WiFi.setSleep(false);            // keep the REST latency low; the wall is mains-powered
    Serial.printf("[net] STA connecting to '%s' ...\n", ssid.c_str());
    WiFi.begin(ssid.c_str(), pass.c_str());
    uint32_t t0 = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - t0 < ARENA_STA_TIMEOUT_MS) {
      delay(250);
      Serial.print('.');
    }
    Serial.println();
    connected = (WiFi.status() == WL_CONNECTED);
    if (connected) s_staReason = "";
    else if (!s_staReason.length()) s_staReason = "delai depasse (aucune reponse)";
  }
  if (connected) {
    s_mode = "STA";
    s_ip = WiFi.localIP().toString();
    Serial.printf("[net] STA OK ip=%s\n", s_ip.c_str());
  } else {
    WiFi.mode(WIFI_AP);
    WiFi.softAP(s_name.c_str(), ARENA_AP_PASS);
    s_mode = "SoftAP";
    s_ip = WiFi.softAPIP().toString();
    Serial.printf("[net] SoftAP '%s' ip=%s\n", s_name.c_str(), s_ip.c_str());
  }
  applyTxPower();
  // Nom d'hote propre a la carte : sans ca, quatre murs se disputent arena.local
  // et mDNS en renomme trois en arena-2, arena-3... au petit bonheur.
  {
    String h = hostify(s_name);
    if (MDNS.begin(h.c_str())) {
      MDNS.addService("http", "tcp", 80);
      MDNS.addServiceTxt("http", "tcp", "wall", s_name.c_str());
      Serial.printf("[net] http://%s.local/\n", h.c_str());
    }
  }

#endif

  startServer();
  Serial.println("[net] http server up");
}

// Pixel de temoin : une pulsation lente dont la COULEUR porte l'etat. Le but
// n'est pas la decoration, c'est de repondre a "est-ce que la carte tourne ?"
// sans cable, sans page web et sans ruban - la question qu'on se pose en
// premier et a laquelle rien ne repondait.
//   ambre  = en cours de demarrage       bleu = point d'acces, personne connecte
//   vert   = associe a un reseau         rouge = defaut signale par le limiteur
static void statusTick() {
#if ARENA_STATUS_LED_ENABLE
  static uint32_t last = 0;
  const uint32_t now = millis();
  if (now - last < 40) return;                 // 25 Hz suffit pour une respiration
  last = now;

  uint8_t r = 40, g = 20, b = 0;               // ambre par defaut
  if (arenaled::ledFault())      { r = 60; g = 0;  b = 0;  }
  else if (s_mode == "STA")      { r = 0;  g = 45; b = 0;  }
  else if (s_mode == "SoftAP")   { r = 0;  g = 15; b = 50; }

  // Respiration : ~2 s par cycle, jamais eteint completement - un temoin qui
  // s'eteint par moments se lit comme un temoin en panne.
  const float k = 0.25f + 0.75f * (0.5f + 0.5f * sinf((float)now / 320.0f));
  neopixelWrite(s_statPin, (uint8_t)(r * k), (uint8_t)(g * k), (uint8_t)(b * k));
#endif
}

void loop() {
  statusTick();
  validateImageWhenHealthy();

  // Redemarrage differe demande par /api/reset : la reponse a eu le temps de
  // partir, l'appelant sait donc que l'ordre a ete accepte.
  if (s_rebootAt && (int32_t)(millis() - s_rebootAt) >= 0) {
    Serial.println("[net] redemarrage demande");
    delay(50);
    ESP.restart();
  }

  // Le balayage tourne ICI : il bloque plusieurs secondes et n'a rien a faire
  // dans un handler HTTP.
  if (s_scanWanted) {
    s_scanWanted = false;
    // API IDF, pas l'objet Arduino WiFi : sous Matter c'est CHIP qui possede
    // esp_wifi et arenanet::begin() sort avant tout WiFi.mode(), donc le
    // wrapper Arduino n'a aucun etat - il rend 0 reseau, RSSI 0, SSID vide.
    // Meme lecon que netHasIp(), qui lit deja au niveau esp_netif.
    // Un balayage exige que l'interface STA EXISTE. Une carte non provisionnee
    // tourne en WIFI_AP seul - exactement l'instant ou l'on a besoin de la liste
    // des reseaux - et esp_wifi_scan_start() y rend ESP_ERR_WIFI_MODE. Le code
    // ne testait que ESP_OK, donc l'echec sortait une liste VIDE, sans un mot :
    // "le scan ne marche pas". On passe en AP+STA, ce qui ajoute la station
    // SANS couper le point d'acces - couper l'AP deconnecterait le telephone
    // qui est en train de regarder la page.
    wifi_mode_t wm = WIFI_MODE_NULL;
    esp_wifi_get_mode(&wm);
    if (wm == WIFI_MODE_AP) {
#ifdef ARENA_MATTER
      // Sous Matter, CHIP possede esp_wifi et le wrapper Arduino n'a aucun etat :
      // il faut passer par l'IDF.
      if (esp_wifi_set_mode(WIFI_MODE_APSTA) == ESP_OK) esp_wifi_start();
#else
      // Hors Matter, c'est WiFi.softAP() qui a monte la radio, donc c'est le
      // wrapper Arduino qui tient les interfaces. Changer le mode par l'IDF
      // seul ne cree PAS le netif station et le wrapper reimpose son propre
      // mode a l'evenement suivant - le balayage repart alors sans station.
      // Passer par WiFi.mode() fait les deux et ne coupe pas le point d'acces.
      WiFi.mode(WIFI_AP_STA);
#endif
      delay(100);                       // laisser l'interface station demarrer
      esp_wifi_get_mode(&wm);
      Serial.printf("[net] balayage : AP -> mode %d (interface station requise)\n", (int)wm);
    }
    wifi_scan_config_t cfg = {};
    cfg.show_hidden = false;
    String j = "[";
    const esp_err_t scanErr = esp_wifi_scan_start(&cfg, true);
    s_scanErr = "";
    if (scanErr != ESP_OK) {
      s_scanErr = String(esp_err_to_name(scanErr)) + " (mode " + String((int)wm) + ")";
      Serial.printf("[net] balayage refuse : %s\n", s_scanErr.c_str());
    }
    if (scanErr == ESP_OK) {
      uint16_t n = 0;
      esp_wifi_scan_get_ap_num(&n);
      if (n > 20) n = 20;
      if (n) {
        wifi_ap_record_t* ap = (wifi_ap_record_t*)calloc(n, sizeof(wifi_ap_record_t));
        if (ap && esp_wifi_scan_get_ap_records(&n, ap) == ESP_OK) {
          for (uint16_t i = 0; i < n; i++) {
            if (i) j += ',';
            j += "{\"s\":\"" + String((const char*)ap[i].ssid) +
                 "\",\"r\":" + String((int)ap[i].rssi) +
                 ",\"c\":" + String((int)ap[i].primary) +
                 ",\"e\":" + String(ap[i].authmode == WIFI_AUTH_OPEN ? 0 : 1) + "}";
          }
        }
        free(ap);
      }
    }
    j += "]";
    s_scanJson = j;
    s_scanAt = millis();
    if (scanErr != ESP_OK) s_scanJson = "[]";
  }

  // Redemarrage differe apres un envoi par morceaux : couper dans le handler
  // tuerait la reponse HTTP avant qu'elle parte, et le navigateur afficherait
  // un echec sur une mise a jour reussie.
  if (s_fwReboot && millis() - s_fwReboot > 600) ESP.restart();

  // Le telechargement OTA tourne ICI, dans la tache principale - surtout pas
  // dans le callback AsyncTCP, ou bloquer sur la flash fait tomber la pile WiFi.
  if (s_pullPending) {
    s_pullPending = false;
    s_pullStatus  = "en cours";
    String err;
    if (pullOta(s_pullUrl, s_pullFs, err)) {
      s_pullStatus = "ok, redemarrage";
      delay(200);
      ESP.restart();
    } else {
      s_pullStatus = "echec: " + err;
    }
  }
}

#ifdef ARENA_MATTER
// Called from loop(): once commissioning hands us a network, raise the HTTP
// server. Until then the wall renders and Matter owns the radio.
void matterTick() {
  static bool up = false;
  esp_netif_t *n = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
  esp_netif_ip_info_t info;
  if (up || !n || esp_netif_get_ip_info(n, &info) != ESP_OK || info.ip.addr == 0) return;
  up = true;
  s_ip = IPAddress(info.ip.addr).toString();
  Serial.printf("[net] ip=%s - starting the web server\n", s_ip.c_str());
  startServer();
}
#endif

}  // namespace arenanet
